In [ ]:
===========================================EDA=============================
1.Pandas  = Data frame operation
2.numpy   = numerical python
3.Matplot = For visulization
4.Seaborn = visulization
5.Plotly  = visulization
6.Bokhe   = visulization

===========================================Machine Learning=======================
7.Scikit  =ML model
8.Stats   = Staticis methods
==========================================Deep learning==========================

9.tensarflow  = Neural network
10.Keras      = keras and tensarflow both combine
11.pytorch    = NN framework

=========================================NLP==================================

12.NLTK    = Natural language tool kit
13 Spacy   = text anayltics
14.Text blob= text analytics

=====================================

In [ ]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

**Step-1: Create a dataframe**

- We can create dataframe as list

- We can create dataframe using dictonery.

In [5]:
import pandas as pd
df1=pd.DataFrame()
df1

Empty DataFrame
Columns: []
Index: []

In [4]:
type(df1)

NameError: name 'df1' is not defined

In [6]:
name=['zaid','vignesh','chiru']
df1=pd.DataFrame(name)
df1

         0
0     zaid
1  vignesh
2    chiru

**Add the column**

In [9]:
name=['zaid','vignesh','chiru']
df1=pd.DataFrame(name,columns=['names'])
df1

     names
0     zaid
1  vignesh
2    chiru

***Create a data by using two list***

In [10]:
name=['zaid','vignesh','chiru']
age=[23,28,30]
df1=pd.DataFrame(zip(name,age),
                 columns=['names','age'])
df1

     names  age
0     zaid   23
1  vignesh   28
2    chiru   30

**create a data by using three list**

In [13]:
name=['zaid','vignesh','chiru']
age=[23,28,30]
city=['Hyd','Pune','Delhi']
cols=['Name','Age','City']
df1=pd.DataFrame(zip(name,age,city),
                 columns=cols)
df1

      Name  Age   City
0     zaid   23    Hyd
1  vignesh   28   Pune
2    chiru   30  Delhi

**change the Index**

In [4]:
import pandas as pd
name=['zaid','vignesh','chiru']
age=[23,28,30]
city=['Hyd','Pune','Delhi']
cols=['Name','Age','City']
idx=['A','B','C']
df1=pd.DataFrame(zip(name,age,city),
                 index=idx,
                 columns=cols)
df1

      Name  Age   City
A     zaid   23    Hyd
B  vignesh   28   Pune
C    chiru   30  Delhi

In [5]:
salary=[100,200,300]
df1['salary']=salary
df1

      Name  Age   City  salary
A     zaid   23    Hyd     100
B  vignesh   28   Pune     200
C    chiru   30  Delhi     300